In [24]:
!pwd

/Users/mysterious/Documents/Flatiron/Projects/Phase1/p1_project

In [25]:
import pandas as pd
import matplotlib.pyplot as plt
import datetime as dt
%matplotlib inline
import sqlite3
import zipfile
conn = sqlite3.Connection("./data/im.db")

In [26]:
# Extract IMDb SQL .db file
with zipfile.ZipFile('./Data/im.db.zip') as zipObj:
    # Extract all contents of .zip file into current directory
    zipObj.extractall(path='./Data/')
    
# Create connection to IMDb DB
conn = sqlite3.connect('./data/im.db')

In [27]:
cur = conn.cursor()

# DATA

In [28]:
find_table_names = """

SELECT name
FROM sqlite_master
WHERE type='table'

"""

In [29]:
cur.execute(find_table_names)

In [30]:
cur.fetchall()

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

In [31]:
## visualizing what each table looks like ## do we know how we go from 146,144 to 63000?##
movies = pd.read_sql("""
SELECT *
  FROM movie_basics;
""", conn)
movies

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [32]:
directors = pd.read_sql("""
SELECT *
  FROM directors;
""", conn)
directors

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]

In [33]:
known = pd.read_sql("""
SELECT *
  FROM known_for;
""", conn)
known.head(100)

    person_id   movie_id
0   nm0061671  tt0837562
1   nm0061671  tt2398241
2   nm0061671  tt0844471
3   nm0061671  tt0118553
4   nm0061865  tt0896534
..        ...        ...
95  nm0069131  tt1125849
96  nm0069131  tt0155267
97  nm0069225  tt0423370
98  nm0069225  tt2040257
99  nm0069225  tt0859592

[100 rows x 2 columns]

In [34]:
movie_akas = pd.read_sql("""
SELECT *
  FROM movie_akas;
""", conn)
movie_akas

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [35]:
ratings = pd.read_sql("""
SELECT *
  FROM movie_ratings;
""", conn)
ratings

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [36]:
persons = pd.read_sql("""
SELECT *
  FROM persons;
""", conn)
persons

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress
606644,nm9990690,Joo Yeon So,NaN,NaN,actress
606645,nm9991320,Madeline Smith,NaN,NaN,actress
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer"

In [37]:
cast = pd.read_sql("""
SELECT *
  FROM principals;
""", conn)
cast

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [38]:
writers = pd.read_sql("""
SELECT *
  FROM writers;
""", conn)
writers

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0438973   nm0175726
2       tt0438973   nm1802864
3       tt0462036   nm1940585
4       tt0835418   nm0310087
...           ...         ...
255868  tt8999892  nm10122246
255869  tt8999974  nm10122357
255870  tt9001390   nm6711477
255871  tt9004986   nm4993825
255872  tt9010172   nm8352242

[255873 rows x 2 columns]

### Some initial observations about our data

Cast table doesnt have data usable for our scope. This was a list of each person 
associated with a particular movie - not just talent but also producers, 
editors, composers, camera crew members, and set desginers.

The known for table also was not usable for the scope of this project. It was more
of an association list, what talent is most know for - ie. Vin Diesel is typically know 
for the Fast and Furious franchise.

# Creating a master DataFrame to work with

In [39]:
## creating a DF using movie_id, title, release year, runtime, director, writer, genres, and movie ratings
q1 = """
SELECT
    movie_id,
    primary_title,
    original_title,
    start_year,
    runtime_minutes,
    genres,
    directors.person_id, 
    movie_ratings.averagerating,
    movie_ratings.numvotes
    
FROM
    movie_basics
    JOIN
        movie_ratings
            USING(movie_id)
    JOIN
        directors
            USING(movie_id)
    JOIN
        writers
            USING(movie_id)
    
WHERE
    start_year >= 2010 AND
    start_year <= 2022


GROUP BY
    movie_basics.movie_id
;
"""
q1_result = pd.read_sql(q1, conn)
q1_result

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,person_id,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540,7.0,77
1,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,nm0000080,6.9,4517
2,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",nm0611531,6.1,13
3,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",nm0749914,6.5,119
4,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy",nm0365480,8.1,263
...,...,...,...,...,...,...,...,...,...
63083,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,130.0,Drama,nm10536451,8.4,365
63084,tt9913084,Diabolik sono io,Diabolik sono io,2019,75.0,Documentary,nm0812850,6.2,6
63085,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,98.0,"Drama,Family",nm4394529,8.7,136
63086,tt9914642,Albatross,Albatross,2017,NaN,Documentary,nm5300859,8.5,8
63087,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,None,nm1716653,6.6,5

In [ ]:
CREATE TABLE Movies (
    movie_id TEXT PRIMARY KEY,
    primary_title TEXT NOT NULL,
    original_tite TEXT NOT NULL,
    start_year TEXT NOT NULL,
    runtime_mintues TEXT NOT NULL,
    genres TEXT NOT NULL,
    person_id TEXT NOT NULL,
    averagerating TEXT NOT NULL,
    numvotes TEXT NOT NULL,
);

In [40]:
q2 = """
CREATE TABLE movie_master

AS 

SELECT
    movie_id,
    primary_title,
    original_title,
    start_year,
    runtime_minutes,
    genres,
    directors.person_id, 
    movie_ratings.averagerating,
    movie_ratings.numvotes
    
FROM
    movie_basics
    JOIN
        movie_ratings
            USING(movie_id)
    JOIN
        directors
            USING(movie_id)
  
    
WHERE
    start_year >= 2010 AND
    start_year <= 2022


GROUP BY
    movie_basics.movie_id
;
"""
q2_result = pd.read_sql(q2, conn)
q2_result

TypeError: 'NoneType' object is not iterable

In [ ]:
find_table_names = """

SELECT name
FROM sqlite_master
WHERE type='table'

"""

In [ ]:
cur.execute(find_table_names)

In [ ]:
##checking to ensure creation of movie table 
cur.fetchall()

In [ ]:
## person id is director id - from.
q3 = """  
SELECT
   movie_id,
    primary_title,
    original_title,
    start_year,
    runtime_minutes,
    genres,
    directors.person_id, 
    movie_ratings.averagerating,
    movie_ratings.numvotes
        
FROM
    movies_master
;
"""
q3_result = pd.read_sql(q3, conn)
q3_result

In [33]:
## adding director and writer names movie_id wasnt working?? so renamed it

In [41]:
q4 = """


SELECT
    movie_id,
    primary_title,
    original_title,
    start_year,
    runtime_minutes,
    genres,
    directors.person_id AS director_id,
    writers.person_id AS writer_id,  
    movie_ratings.averagerating,
    movie_ratings.numvotes
    
FROM
    movie_basics
    JOIN
        writers
            USING(movie_id)
    JOIN
        directors
            USING(movie_id)
    JOIN
        writers
            USING(movie_id)
    
WHERE
    start_year >= 2010 AND
    start_year <= 2022


GROUP BY
    movie_basics.movie_id
;
"""
q4_result = pd.read_sql(q4, conn)
q4_result

DatabaseError: Execution failed on sql '


SELECT
    movie_id,
    primary_title,
    original_title,
    start_year,
    runtime_minutes,
    genres,
    directors.person_id AS director_id,
    writers.person_id AS writer_id,
    movie_ratings.averagerating,
    movie_ratings.numvotes

FROM
    movie_basics
    JOIN
        writers
            USING(movie_id)
    JOIN
        directors
            USING(movie_id)
    JOIN
        writers
            USING(movie_id)

WHERE
    start_year >= 2010 AND
    start_year <= 2022


GROUP BY
    movie_basics.movie_id
;
': ambiguous column name: writers.person_id

In [42]:
##renaming person_id
q5 = """

ALTER TABLE movies

RENAME COLUMN person_id TO drop_id

;
"""
q5_result = pd.read_sql(q5, conn)
q5_result

DatabaseError: Execution failed on sql '

ALTER TABLE movies

RENAME COLUMN person_id TO drop_id

;
': no such table: movies

In [43]:
## replace director / writer column with real names

q6 = """
SELECT
    person_id,
    primary_name
        
FROM
    persons
   
    
GROUP BY
    person_id
;
"""
q6_result = pd.read_sql(q6, conn)
q6_result

        person_id               primary_name
0       nm0000002              Lauren Bacall
1       nm0000003            Brigitte Bardot
2       nm0000005             Ingmar Bergman
3       nm0000006             Ingrid Bergman
4       nm0000007            Humphrey Bogart
...           ...                        ...
606643  nm9993494                  Amjad Ali
606644  nm9993573         Lakisha Louissaint
606645  nm9993616            Ryan Mac Lennan
606646  nm9993650            Marcin Balcerak
606647  nm9993680  Christopher-Lawson Palmer

[606648 rows x 2 columns]

In [45]:
q7 = """
SELECT
    known_for.person_id
    , persons.primary_name
    , group_concat(known_for.movie_id)    
    , group_concat(movie_basics.primary_title)
    
FROM
    known_for

    JOIN
        persons
            USING(person_id)
    JOIN
        movie_basics
            USING(movie_id)

GROUP BY
    persons.primary_name

;
"""
q7_result = pd.read_sql(q7, conn)
q7_result

,person_id,primary_name,group_concat(known_for.movie_id),group_concat(movie_basics.primary_title)
0,nm6950093,!'aru Ikhuisi Piet Berendse,tt4245110,Origins
1,nm6750303,$hutter,"tt4049298,tt1398426,tt2080374,tt1741273","NVTION: The Star Nation Rapumentary,Straight O..."
2,nm2764095,'Atlas' Ramachandran,"tt3433162,tt2333760","Holidays,Three Char Sau Bees"
3,nm5169037,'Atolomake Helu,tt1966622,Tongan Ark
4,nm5420107,'Bad' Chad Broussard,tt1703232,Fightville
...,...,...,...,...
492008,nm5352411,Þórhallur Þórhallsson,"tt3505804,tt5711254,tt7893482,tt5497896","Harry Og Heimir,Snjór og Salóme,Fullir Vasar,J..."
492009,nm4964487,Þórir Bragason,tt2316669,A9ainst
492010,nm8372002,Þórir Ingvarsson,tt5977838,Fit Hostel
492011,nm10211575,Þórunn Lárusdóttir,"tt9174804,tt9174804","Shattered Fragments,Shattered Fragments"
492012,nm5232286,Þórður Aðalbjörnsson,tt2343384,Blóðhefnd

In [47]:
# merge primary_name from the persons table onto our dataframe where director_id matches person_id
directors = q4_result.merge(q6_result, how='left', left_on='director_id', right_on='person_id')

NameError: name 'q4_result' is not defined

In [ ]:
# rename primary_name to director_name
directors = directors.rename({"primary_name":"director_name"}, axis="columns")

In [ ]:
# merge primary_name from the persons table onto our dataframe where writer_id matches person_id
writers = directors.merge(q3_result, how='left', left_on='writer_id', right_on='person_id')

In [ ]:
# rename primary_name to director_name
df = writers.rename({"primary_name":"writer_name"}, axis="columns")

In [ ]:
# drop extraneous columns
df = df.drop(columns=['director_id', 'writer_id', 'person_id_x', 'person_id_y'])

In [ ]:
df

In [ ]:
df.isna().sum()

In [ ]:
conn.close()

In [ ]:
df.info()

In [ ]:
df_budget = pd.read_csv('./data/tn.movie_budgets.csv', index_col=0)

In [ ]:
# convert release_date to a release_year column
df_budget['release_year'] = df_budget['release_date'].apply(lambda x: int(x[-4:]))

In [ ]:
df_budget.info()

In [ ]:
# create simple budget df to merge with main df
df_budget_simple = df_budget[['movie', 'production_budget', 'worldwide_gross', 'release_year']]